Revit 2025 API
StructuralConnectionCodeCheckingStatus Enumeration
 An enumerated type listing all code checking status of the structural connection element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum StructuralConnectionCodeCheckingStatus
Public Enumeration StructuralConnectionCodeCheckingStatus
public enum class StructuralConnectionCodeCheckingStatus
type StructuralConnectionCodeCheckingStatus
Members
Member name | Value | Description
NotCalculated | 0 |  Status not calculated.
OkChecked | 1 |  Status OK checked.
CheckingFailed | 2 |  Status checking failed.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace